// AnimBlueprintGeneratedClass ABP_Zombie_Heavy.ABP_Zombie_Heavy_C
// Size: 0x1550 (Inherited: 0x2c0)
struct UABP_Zombie_Heavy_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x320(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x348(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3f8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x510(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x5c0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x718(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x740(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x788(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x8e0(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x980(0x90)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xa10(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xad8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb98(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xc18(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xcb8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xe10(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xe38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xf90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xfb8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xfe0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1060(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1120(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1168(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1190(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x11b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1310(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1338(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1400(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x14c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x14e8(0x28)
	struct ALFZombie* Character; // 0x1510(0x08)
	float FwdAxisValue; // 0x1518(0x04)
	bool Attacking; // 0x151c(0x01)
	char pad_151D[0x3]; // 0x151d(0x03)
	float RightAxisAngle; // 0x1520(0x04)
	bool IsMoving; // 0x1524(0x01)
	char pad_1525[0x3]; // 0x1525(0x03)
	float InterpValue; // 0x1528(0x04)
	float AttackAlphaBlend; // 0x152c(0x04)
	enum class EAttackType AttackType; // 0x1530(0x01)
	bool IsFalling; // 0x1531(0x01)
	bool IsDead; // 0x1532(0x01)
	char pad_1533[0x5]; // 0x1533(0x05)
	struct UAnimSequenceBase* OverrideArmsAnimation; // 0x1538(0x08)
	bool IsOverrideArms; // 0x1540(0x01)
	char pad_1541[0x3]; // 0x1541(0x03)
	float SpeedBlendMax; // 0x1544(0x04)
	float SpeedBlend; // 0x1548(0x04)
	float SpeedBlendSpeed; // 0x154c(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void UpdateSpeedBlend(); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.UpdateSpeedBlend // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetInterpolatedSpeed(float TargetSpeed, float DeltaTime, float InterpolatedSpeed); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.GetInterpolatedSpeed // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void SetReference(); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.SetReference // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_ABP_Zombie_Heavy(int32_t EntryPoint); // Function ABP_Zombie_Heavy.ABP_Zombie_Heavy_C.ExecuteUbergraph_ABP_Zombie_Heavy // (Final|UbergraphFunction) // @ game+0x1395fe0
};

