// AnimBlueprintGeneratedClass AnimBP_Player_FPP.AnimBP_Player_FPP_C
// Size: 0x1ef9 (Inherited: 0x2c0)
struct UAnimBP_Player_FPP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2f8(0x190)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x488(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x520(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x570(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x598(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x618(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x648(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x6c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x6f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x778(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x7a8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x890(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x930(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xa18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xa48(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xaf8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xb78(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xc40(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xcc0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xda8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xdd8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xe88(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xf28(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xfc8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1120(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1148(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1208(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x12f0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x13b0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x13d8(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x14c0(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1570(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1598(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1618(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1700(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17c0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1860(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1890(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1940(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1a98(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1ac0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1b88(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1c50(0x80)
	float Speed; // 0x1cd0(0x04)
	float Direction; // 0x1cd4(0x04)
	float SwayVerticalMultiplier; // 0x1cd8(0x04)
	float SwayVertical; // 0x1cdc(0x04)
	float SwayHorizontal; // 0x1ce0(0x04)
	float SwayInterpSpeed; // 0x1ce4(0x04)
	struct FRotator PrevControlRotation; // 0x1ce8(0x0c)
	float SwayForward; // 0x1cf4(0x04)
	float SwayRightward; // 0x1cf8(0x04)
	struct FVector PrevVelocity; // 0x1cfc(0x0c)
	struct UBlendSpace* LocomotionBlendSpace; // 0x1d08(0x08)
	struct UBlendSpace* LocomotionCrouchBlendSpace; // 0x1d10(0x08)
	struct UAimOffsetBlendSpace* LocomotionSwayAimOffset; // 0x1d18(0x08)
	bool bIsCrouching; // 0x1d20(0x01)
	bool bIsFalling; // 0x1d21(0x01)
	char pad_1D22[0x6]; // 0x1d22(0x06)
	struct UAnimSequenceBase* JumpStart; // 0x1d28(0x08)
	struct UAnimSequenceBase* JumpLoop; // 0x1d30(0x08)
	struct UAnimSequenceBase* JumpEnd; // 0x1d38(0x08)
	float AimAlpha; // 0x1d40(0x04)
	char pad_1D44[0x4]; // 0x1d44(0x04)
	struct UAnimSequenceBase* AimAnimation; // 0x1d48(0x08)
	bool bIsSwimming; // 0x1d50(0x01)
	char pad_1D51[0x7]; // 0x1d51(0x07)
	struct FFirstPersonEquipmentLocomotionData DefaultAnimSet; // 0x1d58(0x170)
	bool IsDefending; // 0x1ec8(0x01)
	enum class EWeaponPoseType SubWeaponPoseType; // 0x1ec9(0x01)
	char pad_1ECA[0x6]; // 0x1eca(0x06)
	struct UAnimSequenceBase* LocomotionAdditiveAnimation; // 0x1ed0(0x08)
	struct UAnimSequenceBase* FinalAdditiveAnimation; // 0x1ed8(0x08)
	struct UBlendSpace* DefaultLocomotion; // 0x1ee0(0x08)
	struct UBlendSpace* DefaultCrouch; // 0x1ee8(0x08)
	struct UAimOffsetBlendSpace* DefaultSway; // 0x1ef0(0x08)
	bool bIsDead; // 0x1ef8(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SaveLocomotionFallback(); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.SaveLocomotionFallback // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEquipmentLocomotion(struct FFirstPersonEquipmentLocomotionData FirstPersonEquipmentLocomotionData); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.SetEquipmentLocomotion // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SaveSwayRotationValues(float DeltaTime); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.SaveSwayRotationValues // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SaveSwayValues(float DeltaTime); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.SaveSwayValues // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SaveDirectionAndSpeed(); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.SaveDirectionAndSpeed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_FPP_AnimGraphNode_TransitionResult_3BE27BD64DA0EDF251605C9E93B157E3(); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_FPP_AnimGraphNode_TransitionResult_3BE27BD64DA0EDF251605C9E93B157E3 // (BlueprintEvent) // @ game+0x1395fe0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_FPP_AnimGraphNode_TransitionResult_DD1C635F43BC8F76CCAF8B8224B9157B(); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_FPP_AnimGraphNode_TransitionResult_DD1C635F43BC8F76CCAF8B8224B9157B // (BlueprintEvent) // @ game+0x1395fe0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void BlueprintBeginPlay(); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_AnimBP_Player_FPP(int32_t EntryPoint); // Function AnimBP_Player_FPP.AnimBP_Player_FPP_C.ExecuteUbergraph_AnimBP_Player_FPP // (Final|UbergraphFunction|HasDefaults) // @ game+0x1395fe0
};

