// BlueprintGeneratedClass BP_LobbyPreviewActor.BP_LobbyPreviewActor_C
// Size: 0x280 (Inherited: 0x220)
struct ABP_LobbyPreviewActor_C : AActor {
	struct USceneCaptureComponent2D* SceneCapture; // 0x220(0x08)
	struct URectLightComponent* RectLight4; // 0x228(0x08)
	struct UPointLightComponent* PointLight2; // 0x230(0x08)
	struct URectLightComponent* RectLight3; // 0x238(0x08)
	struct URectLightComponent* RectLight2; // 0x240(0x08)
	struct URectLightComponent* RectLight1; // 0x248(0x08)
	struct URectLightComponent* RectLight; // 0x250(0x08)
	struct UPointLightComponent* PointLight1; // 0x258(0x08)
	struct UPointLightComponent* PointLight; // 0x260(0x08)
	struct USpotLightComponent* SpotLight; // 0x268(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x270(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x278(0x08)

	void UserConstructionScript(); // Function BP_LobbyPreviewActor.BP_LobbyPreviewActor_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
};

