// UserDefinedStruct BS_AquaticInteractionData.BS_AquaticInteractionData
// Size: 0x28 (Inherited: 0x00)
struct FBS_AquaticInteractionData {
	float Force_10_2F4FD72F49BCBB81FA9729A268993C4D; // 0x00(0x04)
	float Torque_26_BFFA81594F81A9D829E82083436A0590; // 0x04(0x04)
	float RandomOffset_35_2B37AF5E4D20E2DF8559718620844133; // 0x08(0x04)
	float Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B; // 0x0c(0x04)
	float Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7; // 0x10(0x04)
	float MaxForce_34_6499E59046192D125441009588B75BF6; // 0x14(0x04)
	float MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920; // 0x18(0x04)
	int32_t SplashEmiter_53_9482201B42685C048A4C0D9D95A8BD4D; // 0x1c(0x04)
	float SplashOffsetZ_44_5B2896334632B17A889BCC8B2D45A465; // 0x20(0x04)
	float SplashEmiterScale_68_B58ED4F243C46D959CA73D81C8FC7485; // 0x24(0x04)
};

