// AnimBlueprintGeneratedClass LF_ALS_Player_AnimBP.LF_ALS_Player_AnimBP_C
// Size: 0xfcb4 (Inherited: 0x2c0)
struct ULF_ALS_Player_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_40; // 0x2c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x420(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0x448(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x4f8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_39; // 0x520(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_38; // 0x5e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x6a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x6c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x6f0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_37; // 0x718(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_39; // 0x7d8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0x930(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0xa88(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0xbe0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_36; // 0xc60(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0xd20(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0xe08(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0xe88(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0xf50(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0xff0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x10d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x1158(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x11d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x1278(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0x12f8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x13a8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x13d8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x1488(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x15e0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x1680(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x16a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x16d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x16f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x1720(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_35; // 0x1748(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x1808(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x1960(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x1988(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x19b0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0x19d8(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x1b30(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x1bf8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x1d50(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x1d78(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x1ed0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x1ef8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x2050(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0x2078(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x2128(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x2150(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x2238(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_34; // 0x22b8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x2378(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x23f8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x24e0(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_33; // 0x25c8(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0x2688(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x2738(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x2820(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_32; // 0x28a0(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x2960(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0x2a48(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x2af8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x2be0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2c60(0xc8)
	struct FAnimNode_Mirror AnimGraphNode_Mirror; // 0x2d28(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x2d50(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x2e38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x2eb8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_31; // 0x2f38(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_30; // 0x2ff8(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x30b8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x31a0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0x3288(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x3338(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0x3420(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x34d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x35b8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x36a0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_29; // 0x3720(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x37e0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x38c8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x3948(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x3a10(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x3af8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x3be0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x3cc8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x3d78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x3e60(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x3f48(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x3ff8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x40e0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x41c8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x42b0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x4398(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x4448(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x4478(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x4528(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x4680(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_11; // 0x46a8(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x4838(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x48b8(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x4a48(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x4ac8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x4b78(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x4bf8(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x4d88(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_28; // 0x4e08(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x4ec8(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x4f48(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0x50d8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x5198(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x5218(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x5298(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x5318(0xc0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x53d8(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x5568(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x55e8(0xc0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x56a8(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x5838(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x58b8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x5938(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x59f8(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x5a78(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x5c08(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x5c88(0xc0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x5d48(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x5ed8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x5f58(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x5fd8(0x190)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x6168(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x6218(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x6248(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x62f8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x6450(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x6478(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x6560(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x6648(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x66f8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x6728(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x67d8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x6800(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x68c8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x6978(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x69a0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x6af8(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x6b20(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x6c08(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x6c38(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x6ce8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x6e40(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x6e68(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x6f28(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x6fe8(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x7140(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x7188(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x71b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x71d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x7200(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x7228(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x72f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x7448(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x7470(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x7530(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x7558(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x7580(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x7630(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x7788(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x77b0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x77d8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x7898(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x78c0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x7980(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x7ad8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x7b00(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x7bc0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x7c80(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x7ca8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x7d58(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x7d80(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x7e40(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x7e68(0x158)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x7fc0(0x20)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x7fe0(0x190)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x8170(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x8190(0x20)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x81b0(0x190)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x8340(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x8360(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x8420(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x84d0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x8590(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x86e8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x8840(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x8868(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x8890(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x88b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x8a10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x8a38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x8a60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x8a88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x8ab0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x8ad8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x8b00(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x8ba0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x8cf8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x8d98(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x8dc0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x8e80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x8ea8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x8ed0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x8ef8(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x9050(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x90f0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x9118(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x9270(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x9298(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x92c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x92e8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x9310(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x93d0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x9480(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x95d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x9600(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x9628(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x96e8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x9710(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x97d0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x97f8(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x98b8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x9968(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x9a08(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x9a30(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x9af8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x9b40(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x9b68(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x9cc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x9ce8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x9d10(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x9d38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x9e90(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x9eb8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x9f78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x9fa0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x9fc8(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0xa120(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0xa1d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0xa1f8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0xa220(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xa3b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xa430(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xa4b0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xa608(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xa630(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xa658(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0xa680(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xa748(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xa808(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xa960(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xa9e0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xaaa0(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xab20(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xac78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xaca0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0xacc8(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xad90(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xaee8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xaf88(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xafb0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xafd0(0x20)
	struct FAnimNode_DragonSpineSolver AnimGraphNode_DragonSpineSolver; // 0xaff0(0x4f0)
	struct FAnimNode_DragonFeetSolver AnimGraphNode_DragonFeetSolver; // 0xb4e0(0x330)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xb810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xb838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xb860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xb888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xb8b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xb8d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xb900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xb928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0xb950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0xb978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0xb9a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0xb9c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0xb9f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0xba18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0xba40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xba68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xba90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xbab8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xbae0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xbb08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xbb30(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xbb58(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xbbd8(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xbca0(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xbcf0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xbdb8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0xbe38(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xbe68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xbee8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xbf18(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xbf98(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xc060(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xc0b0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xc178(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0xc1f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xc228(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xc2a8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xc2d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xc300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xc328(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xc350(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xc3d0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xc400(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xc448(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xc4c8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xc578(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xc5f8(0xc8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xc6c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xc6e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xc710(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xc738(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xc760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xc788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xc7b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xc7d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xc800(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xc828(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xc850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xc878(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xc8a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xc8c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xc8f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xc918(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xc940(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xca28(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xca58(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xca80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xcb00(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xcb30(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xcbd0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xccb8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xcda0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xcdd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xcdf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xce20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xce48(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xce70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xcef0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xcf20(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xcfa0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xcfd0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xd050(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd080(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xd0b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd130(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xd160(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xd210(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xd240(0xe8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xd328(0x58)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xd380(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xd468(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xd518(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xd600(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xd6c0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xd6f0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xd738(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xd760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xd788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xd7b0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xd7d8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xd808(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xd888(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xd8b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xd938(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xd968(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xd9e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xda18(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xdac8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xdaf8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xdba8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xdbf0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xdc20(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xdcd0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xdcf8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xde50(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xde78(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xdfd0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xdff8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xe098(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xe138(0x158)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_3; // 0xe290(0x90)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xe320(0x70)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xe390(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_2; // 0xe430(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xe4c0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xe4e8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xe640(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xe668(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xe7f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xe820(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xe848(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xe8e8(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xe988(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xea48(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xea70(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xebc8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xebf0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xec18(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xec40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xec68(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xec90(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xed40(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xed68(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xee28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xee50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xee78(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xeea0(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xeee8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xef98(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xefc0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xf070(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xf120(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xf148(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xf178(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xf2d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xf2f8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xf320(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xf3e0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xf408(0xa0)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xf4a8(0x90)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xf538(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xf5d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xf600(0x158)
	struct ALF_ALS_Character_BP_C* ALS_BaseCharacter; // 0xf758(0x08)
	struct FVector Velocity; // 0xf760(0x0c)
	struct FVector2D AimOffset; // 0xf76c(0x08)
	struct FVector2D LeanGrounded; // 0xf774(0x08)
	struct FVector2D FeetPosition; // 0xf77c(0x08)
	enum class MovementDirection MovementDirection; // 0xf784(0x01)
	char pad_F785[0x3]; // 0xf785(0x03)
	struct UCurveFloat* FlailAlphaCurve; // 0xf788(0x08)
	struct UCurveFloat* LandAlphaCurve; // 0xf790(0x08)
	enum class LocomotionState ActiveLocomotionState; // 0xf798(0x01)
	enum class IdleEntryState IdleEntryState; // 0xf799(0x01)
	enum class ALS_MovementMode ALS_PrevMovementMode; // 0xf79a(0x01)
	char pad_F79B[0x1]; // 0xf79b(0x01)
	struct FRotator CharacterRotation; // 0xf79c(0x0c)
	struct FRotator LastVelocityRotation; // 0xf7a8(0x0c)
	struct FRotator LastMovementInputRotation; // 0xf7b4(0x0c)
	struct FRotator LookingRotation; // 0xf7c0(0x0c)
	float AimYawDelta; // 0xf7cc(0x04)
	float AimYawRate; // 0xf7d0(0x04)
	enum class ALS_MovementMode ALS_MovementMode; // 0xf7d4(0x01)
	enum class ALS_Gait ALS_Gait; // 0xf7d5(0x01)
	enum class ALS_Stance ALS_Stance; // 0xf7d6(0x01)
	enum class ALS_RotationMode ALS_RotationMode; // 0xf7d7(0x01)
	float Direction; // 0xf7d8(0x04)
	float Speed; // 0xf7dc(0x04)
	float GaitValue; // 0xf7e0(0x04)
	float N_PlayRate; // 0xf7e4(0x04)
	float C_PlayRate; // 0xf7e8(0x04)
	float StartPosition; // 0xf7ec(0x04)
	float LeanInAir; // 0xf7f0(0x04)
	struct FRotator PreviousVelocityRotation; // 0xf7f4(0x0c)
	float VelocityDifference; // 0xf800(0x04)
	float PreviousSpeed; // 0xf804(0x04)
	float AccelerationDifference; // 0xf808(0x04)
	float FlailRate; // 0xf80c(0x04)
	float FlailBlendAlpha; // 0xf810(0x04)
	float LandPredictionAlpha; // 0xf814(0x04)
	struct FALS_PivotParams PivotParams; // 0xf818(0x14)
	float CharacterRotationDifference; // 0xf82c(0x04)
	float VelocityDifference; // 0xf830(0x04)
	bool ALS_Aiming; // 0xf834(0x01)
	bool IsMoving; // 0xf835(0x01)
	bool HasMovementInput; // 0xf836(0x01)
	bool ShowTraces; // 0xf837(0x01)
	bool TurningInPlace; // 0xf838(0x01)
	bool ShouldTurnInPlace; // 0xf839(0x01)
	bool TurningRight; // 0xf83a(0x01)
	char pad_F83B[0x1]; // 0xf83b(0x01)
	float TurnInPlaceDelayCount; // 0xf83c(0x04)
	struct UCharacterMovementComponent* CharacterMovement; // 0xf840(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0xf848(0x08)
	struct UAnimMontage* ActiveTurnInPlaceMontage; // 0xf850(0x08)
	float WalkingSpeed; // 0xf858(0x04)
	float RunningSpeed; // 0xf85c(0x04)
	float SprintingSpeed; // 0xf860(0x04)
	float CrouchingSpeed; // 0xf864(0x04)
	struct UAnimMontage* GetUpFromBack; // 0xf868(0x08)
	struct UAnimMontage* GetUpFromFront; // 0xf870(0x08)
	struct UAnimSequenceBase* AdditiveLand; // 0xf878(0x08)
	struct FTurnAnims N_Turn_91; // 0xf880(0x10)
	struct FTurnAnims N_Turn_181; // 0xf890(0x10)
	struct FTurnAnims LF_Turn_91; // 0xf8a0(0x10)
	struct FTurnAnims RF_Turn_91; // 0xf8b0(0x10)
	struct FTurnAnims CLF_Turn_91; // 0xf8c0(0x10)
	struct FTurnAnims CRF_Turn_91; // 0xf8d0(0x10)
	struct ALFCharacterPlayer* Character; // 0xf8e0(0x08)
	struct ULFCharacterEquipmentComponent* CharacterEquipment; // 0xf8e8(0x08)
	bool bIsSwimming; // 0xf8f0(0x01)
	enum class EPoseType Pose; // 0xf8f1(0x01)
	enum class ECharacterState CharacterState; // 0xf8f2(0x01)
	char pad_F8F3[0x1]; // 0xf8f3(0x01)
	float AimAlpha; // 0xf8f4(0x04)
	float AimOffsetAlpha; // 0xf8f8(0x04)
	float LocomotionRateScale; // 0xf8fc(0x04)
	float MouseDeltaX; // 0xf900(0x04)
	float LookAtYaw; // 0xf904(0x04)
	float LookAtPitch; // 0xf908(0x04)
	float TurnThreshold; // 0xf90c(0x04)
	float MinTurnLength; // 0xf910(0x04)
	enum class EWeaponType WeaponType; // 0xf914(0x01)
	char pad_F915[0x3]; // 0xf915(0x03)
	float SpeedBlend; // 0xf918(0x04)
	float SpeedBlendMax; // 0xf91c(0x04)
	float SpeedBlendSpeed; // 0xf920(0x04)
	float SubWeaponPoseBlendWeight; // 0xf924(0x04)
	float WeaponPoseBlendWeight; // 0xf928(0x04)
	enum class EWeaponPoseType WeaponPoseType; // 0xf92c(0x01)
	enum class EWeaponPoseType SubWeaponPoseType; // 0xf92d(0x01)
	char pad_F92E[0x2]; // 0xf92e(0x02)
	struct FTransform RightHandIKTransformLocation; // 0xf930(0x30)
	struct FTransform LeftHandIKTransformLocation; // 0xf960(0x30)
	float FABRIKAlphaLeft; // 0xf990(0x04)
	float FABRIKAlphaRight; // 0xf994(0x04)
	bool bIsEquipUseCrouchLocomotion; // 0xf998(0x01)
	bool bIsEquipUseLocomotion; // 0xf999(0x01)
	char pad_F99A[0x6]; // 0xf99a(0x06)
	struct TMap<enum class EWeaponPoseType, bool> WeaponCrouchLocomotionMap; // 0xf9a0(0x50)
	float LastDeltaTime; // 0xf9f0(0x04)
	char pad_F9F4[0x4]; // 0xf9f4(0x04)
	struct TMap<enum class EWeaponPoseType, float> WeaponCrouchBlendMap; // 0xf9f8(0x50)
	float WeaponCrouchBlend; // 0xfa48(0x04)
	float SubWeaponCrouchBlend; // 0xfa4c(0x04)
	struct TMap<enum class EWeaponPoseType, float> WeaponCrouchLeftIK; // 0xfa50(0x50)
	struct TMap<enum class EWeaponPoseType, float> WeaponCrouchRightIK; // 0xfaa0(0x50)
	struct TMap<enum class EWeaponPoseType, bool> WeaponHandOverride; // 0xfaf0(0x50)
	float CrouchLeftIKBlend; // 0xfb40(0x04)
	float CrouchRightIKBlend; // 0xfb44(0x04)
	bool IsAttacking; // 0xfb48(0x01)
	char pad_FB49[0x3]; // 0xfb49(0x03)
	float LeftHandGrabWeight; // 0xfb4c(0x04)
	float RightHandGrabWeight; // 0xfb50(0x04)
	bool bHandOverride; // 0xfb54(0x01)
	bool bHandEnable; // 0xfb55(0x01)
	char pad_FB56[0x2]; // 0xfb56(0x02)
	float HandOverrideWeight; // 0xfb58(0x04)
	bool isWalking?; // 0xfb5c(0x01)
	bool IsInAir?; // 0xfb5d(0x01)
	char pad_FB5E[0x2]; // 0xfb5e(0x02)
	float DragonSpeed; // 0xfb60(0x04)
	char pad_FB64[0x4]; // 0xfb64(0x04)
	struct TArray<struct FDragonData_FootData> FeetBones; // 0xfb68(0x10)
	enum class EPoseType PrevPose; // 0xfb78(0x01)
	bool IsDead; // 0xfb79(0x01)
	char pad_FB7A[0x6]; // 0xfb7a(0x06)
	struct FPoseSnapshot Snapshot; // 0xfb80(0x38)
	bool bIsAttackBlocked; // 0xfbb8(0x01)
	char pad_FBB9[0x7]; // 0xfbb9(0x07)
	struct FPoseSnapshot AttackBlockSnapshot; // 0xfbc0(0x38)
	float AttackBlockInSecond; // 0xfbf8(0x04)
	float AttackBlockOutSecond; // 0xfbfc(0x04)
	bool bAttackBlockOut; // 0xfc00(0x01)
	char pad_FC01[0x7]; // 0xfc01(0x07)
	struct FPoseSnapshot AttackFirstSnapshot; // 0xfc08(0x38)
	bool bUseSpineAim; // 0xfc40(0x01)
	bool bLeftArmBlend; // 0xfc41(0x01)
	char pad_FC42[0x2]; // 0xfc42(0x02)
	float SpeedBlendOneMinus; // 0xfc44(0x04)
	float SpeedBlendStanceValue; // 0xfc48(0x04)
	float LeftHandIK; // 0xfc4c(0x04)
	float RightHandIK; // 0xfc50(0x04)
	bool bShouldUpdateIK; // 0xfc54(0x01)
	char pad_FC55[0x3]; // 0xfc55(0x03)
	struct ULFCharacterDefenseComponent* CharacterDefense; // 0xfc58(0x08)
	bool IsDefending; // 0xfc60(0x01)
	char pad_FC61[0x7]; // 0xfc61(0x07)
	struct FPoseSnapshot AttackCurrentSnapshot; // 0xfc68(0x38)
	struct ULFEquipmentSwapAnimComponent* CharacterSwap; // 0xfca0(0x08)
	float EquipmentSwapBlend; // 0xfca8(0x04)
	float EquipmentSwapDelay; // 0xfcac(0x04)
	enum class EEquipmentSwapState EquipmentSwapState; // 0xfcb0(0x01)
	enum class EPoseType EquipmentSwapPrevPose; // 0xfcb1(0x01)
	enum class EWeaponType EquipmentPrevWeaponType; // 0xfcb2(0x01)
	enum class EWeaponPoseType EquipmentPrevSubWeaponPoseType; // 0xfcb3(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function LF_ALS_Player_AnimBP.LF_ALS_Player_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetIdleToCrouch(struct UAnimSequenceBase* Anim); // Function LF_ALS_Player_AnimBP.LF_ALS_Player_AnimBP_C.GetIdleToCrouch // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
	void OverrideRightHandGrab(float Desired); // Function LF_ALS_Player_AnimBP.LF_ALS_Player_AnimBP_C.OverrideRightHandGrab // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void OverrideLeftHandGrab(float Desired); // Function LF_ALS_Player_AnimBP.LF_ALS_Player_AnimBP_C.OverrideLeftHandGrab // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
