// UserDefinedStruct S_Ephemera.S_Ephemera
// Size: 0x5b (Inherited: 0x00)
struct FS_Ephemera {
	struct AActor* ActorClass_79_60EEAFC4466A843D71055090DCF1820B; // 0x00(0x08)
	struct AActor* Actor_25_CB9E98F44229E223BCBAD7AEE2C3B438; // 0x08(0x08)
	int32_t AdjustedPage_59_04F276CF4A933274B1D399AECD1907CC; // 0x10(0x04)
	int32_t Page_60_F83C579041BC472752CA048F3898D2FF; // 0x14(0x04)
	bool Flattenbetweenpages_28_4245BBFF4B7555A92BD26488777BEB0A; // 0x18(0x01)
	bool RenderAlways_34_BAD0CE0E4C654EE518E5329547E5FA7D; // 0x19(0x01)
	char pad_1A[0x2]; // 0x1a(0x02)
	struct FVector Offsetfrompagecenter_30_3461257849FBA4B4E2C53DA9A9757C10; // 0x1c(0x0c)
	float Angleaskewonpage_54_E455CC2E463421C421F8699C952AAD9B; // 0x28(0x04)
	float Rotationonpage_20_D136E072446DC5F69C8F1885D15A3575; // 0x2c(0x04)
	struct FVector Scale_19_3267A75244F9096739F4F4A0F400B925; // 0x30(0x0c)
	enum class E_EphemeraAnim AnimationEffect_62_F4DDEE854B1E6030E0D5F5A70F44BC99; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float AnimationDegrees_37_D335075749C0C182D94DE6B677021229; // 0x40(0x04)
	int32_t IndexinEphemeraArray_48_1793E96141B749C0354146BB2AA1853B; // 0x44(0x04)
	struct USoundBase* AnimationSoundOpening_67_E0CA32F04F4E8FE12D413ABAD6D237E4; // 0x48(0x08)
	struct USoundBase* AnimationSoundClosing_69_E51C086840E8891725CC38A972D62911; // 0x50(0x08)
	bool AbsolutePosAdvanced_71_7F4400AA47F100EEF1CB528444426118; // 0x58(0x01)
	bool UseAsMenuWidget_73_9237FA024EB8D7C290EE4CA781507BE2; // 0x59(0x01)
	bool CollisionOnCurrentPageSpreadOnly_76_D64E3219432FE8736F85B5A19F362F07; // 0x5a(0x01)
};

