// UserDefinedStruct S_QuestNotificatorInfo.S_QuestNotificatorInfo
// Size: 0xa0 (Inherited: 0x00)
struct FS_QuestNotificatorInfo {
	struct UObject* Icon_3_B708E5D440250E722536638194D23315; // 0x00(0x08)
	float IconScale_43_9122F7FE4F984C995E7E3E9A040053D3; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText QuestType_32_80ED37F84D88E8E9A0601B98A751387D; // 0x10(0x18)
	struct FText QuestHeadline_27_0F29D2E443629A61AF7FECB6F4C7EAB9; // 0x28(0x18)
	struct FText QuestText_28_E299A4784C506DAE626EB5ABFC1AEF96; // 0x40(0x18)
	struct FLinearColor IconFrameColor_6_563CD1824E5762594B3AE4B3E7485999; // 0x58(0x10)
	struct FLinearColor TextFrameColor_29_83C6021749BA483DC040E990E6844916; // 0x68(0x10)
	bool TextFrameParticles?_33_96E976054159DB255D777383B66DE038; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	struct FLinearColor TextFrameParticlesColor_34_A38BAFEE45B9A2E29F1E7D99A2B68D3D; // 0x7c(0x10)
	bool IconFrameParticles?_37_441D2A004127047AAC0EA5BA29AB1BD6; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	struct FLinearColor IconFrameParticlesColor_40_DD1F173646132C2250A54CBB7543AC2E; // 0x90(0x10)
};

