// UserDefinedStruct S_SpineInfo.S_SpineInfo
// Size: 0x70 (Inherited: 0x00)
struct FS_SpineInfo {
	struct FText LengthwiseHeading_18_2F141DD041CB225C56F505BAF8F95ED4; // 0x00(0x18)
	enum class E_SpineFont LengthwiseHeadingFontColor_55_B893AF474DF7765335E1E580642D939E; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	int32_t LengthwiseHeadingsize_25_5AB385B3429A6289073CCA85290DF7CF; // 0x1c(0x04)
	enum class ETextJustify LengthwiseHeadingalignment_38_55A449764C4C7DF576D59BA44C38F1E6; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FText TopText_20_CE0460E04ED48293F0762AB3BDBEFF94; // 0x28(0x18)
	enum class E_SpineFont TopTextFontColor_53_FACBC88D4F9865D1E43C8292466E4DC8; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t TopTextsize_27_5BD264B247D322A1AF5D288CC7CDB4B9; // 0x44(0x04)
	struct FText BottomText_22_E1D939784E85581B155A7DB4FD3F156E; // 0x48(0x18)
	enum class E_SpineFont BottomTextFontColor_54_B4EBF2464E6D4C9208A347B072668EEE; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	int32_t BottomTextsize_29_C9A883DF45DAAC9F7D2DD0A5CC58C5A9; // 0x64(0x04)
	int32_t PaddingAtTop_44_1FDA4CD34D3AA8A1CA940499B47C1523; // 0x68(0x04)
	int32_t PaddingAtBottom_45_41F01F604BC768655936D5B472657188; // 0x6c(0x04)
};

