// UserDefinedStruct S_Typography.S_Typography
// Size: 0x99 (Inherited: 0x00)
struct FS_Typography {
	struct FMargin Margins_79_831F73B54573C4F7BA8276916D621A40; // 0x00(0x10)
	enum class E_PageFont HeadingFont_15_BD131BDB4F5064029F6700B225052D28; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct UFont* HeadingFontOverride_7_FF09BEAC4F484F1ADF8E519C4F0D5C2D; // 0x18(0x08)
	int32_t HeadingSize_23_8C7557B042637740CD53D5BD24C4F073; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FSlateColor HeadingColor_24_B548E770406798D1E8F02BB8E1B7A6CD; // 0x28(0x28)
	int32_t HeadingPadding_12_AA4DA8024351217947D936AA1B306DB7; // 0x50(0x04)
	enum class ETextJustify HeadingAlignment_73_9EE0F87345EBFEF8B720B4A14170C1E6; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32_t PicturePadding_32_BFC613CD4CF0BA60E4F098AC90D1C467; // 0x58(0x04)
	enum class EHorizontalAlignment PictureAlignment_64_B432C41742C5C77F096521ADF09E7E11; // 0x5c(0x01)
	enum class E_PageFont BodyFont_19_AD69E69B4DB8D13D2C481087BC34E076; // 0x5d(0x01)
	char pad_5E[0x2]; // 0x5e(0x02)
	struct UFont* BodyFontOverride_22_AC71894342D66D47FFFBC8A96421A673; // 0x60(0x08)
	int32_t BodySize_29_65FA78A34FFC2EAAD8E57EAAC63B48A9; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FSlateColor BodyColor_28_C027BB244697E3D3BD5CA5BCA5D03927; // 0x70(0x28)
	enum class ETextJustify BodyAlignment_74_63D310DE4708EEE41EBE38867A15D79D; // 0x98(0x01)
};

