// UserDefinedStruct S_UpdaterNotificatorInfo.S_UpdaterNotificatorInfo
// Size: 0x7c (Inherited: 0x00)
struct FS_UpdaterNotificatorInfo {
	struct UObject* Icon_3_B708E5D440250E722536638194D23315; // 0x00(0x08)
	struct FText NotifyHeadline_12_0F29D2E443629A61AF7FECB6F4C7EAB9; // 0x08(0x18)
	struct FText NotifyText_11_E299A4784C506DAE626EB5ABFC1AEF96; // 0x20(0x18)
	struct FLinearColor IconFrameColor_6_563CD1824E5762594B3AE4B3E7485999; // 0x38(0x10)
	struct FLinearColor NotifyFrameColor_15_83C6021749BA483DC040E990E6844916; // 0x48(0x10)
	struct FLinearColor HighlightsColor_26_207E256048A66A4F109F479B2BD0C93F; // 0x58(0x10)
	bool Particles?_22_96E976054159DB255D777383B66DE038; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FLinearColor ParticlesColor_24_A38BAFEE45B9A2E29F1E7D99A2B68D3D; // 0x6c(0x10)
};

