// Class SteamCoreWeb.SteamCoreWeb
// Size: 0x28 (Inherited: 0x28)
struct USteamCoreWeb : UObject {
};

// Class SteamCoreWeb.SteamCoreWebSubsystem
// Size: 0x48 (Inherited: 0x30)
struct USteamCoreWebSubsystem : UGameInstanceSubsystem {
	char pad_30[0x18]; // 0x30(0x18)
};

// Class SteamCoreWeb.SteamCoreWebAsyncAction
// Size: 0x50 (Inherited: 0x30)
struct USteamCoreWebAsyncAction : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate OnCallback; // 0x30(0x10)
	char pad_40[0x10]; // 0x40(0x10)

	void HandleCallback(struct FString data, bool bWasSuccessful); // Function SteamCoreWeb.SteamCoreWebAsyncAction.HandleCallback // (Native|Public) // @ game+0xc0e3b0
};

// Class SteamCoreWeb.SteamCoreWebSettings
// Size: 0x78 (Inherited: 0x38)
struct USteamCoreWebSettings : UDeveloperSettings {
	float AsyncTaskTimeout; // 0x38(0x04)
	int32_t DisabledSubsystems; // 0x3c(0x04)
	bool bDebugging; // 0x40(0x01)
	bool bDevMode; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FString Key; // 0x48(0x10)
	int32_t AppID; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString DevSteamID; // 0x60(0x10)
	bool bSandboxMode; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class SteamCoreWeb.SteamWebUtilities
// Size: 0x28 (Inherited: 0x28)
struct USteamWebUtilities : UBlueprintFunctionLibrary {

	bool ParseJson(struct FString JsonString, struct TArray<struct FSteamCoreJson> data); // Function SteamCoreWeb.SteamWebUtilities.ParseJson // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0xc0e4a0
	struct FString GetProjectKey(); // Function SteamCoreWeb.SteamWebUtilities.GetProjectKey // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xc0dc90
	int32_t GetProjectAppID(); // Function SteamCoreWeb.SteamWebUtilities.GetProjectAppID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xc0dc60
	struct FString GetDevSteamID(); // Function SteamCoreWeb.SteamWebUtilities.GetDevSteamID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xc0d8f0
