// WidgetBlueprintGeneratedClass TeamSystem.TeamSystem_C
// Size: 0x378 (Inherited: 0x260)
struct UTeamSystem_C : UUserWidget {
	struct UWidgetAnimation* OtherPlayer_ReflashIcon; // 0x260(0x08)
	struct UWidgetAnimation* OtherPlayer_RefreshBtnAni; // 0x268(0x08)
	struct UWidgetAnimation* MyTeam_RefreshBtnAni; // 0x270(0x08)
	struct UWidgetAnimation* MyTeam_ReflashIcon; // 0x278(0x08)
	struct UImage* Back; // 0x280(0x08)
	struct UImage* Back_2; // 0x288(0x08)
	struct UButton* BackBtn; // 0x290(0x08)
	struct UImage* BackIcon_2; // 0x298(0x08)
	struct UImage* BackImg_2; // 0x2a0(0x08)
	struct UImage* BackImg_3; // 0x2a8(0x08)
	struct UImage* BackImg_4; // 0x2b0(0x08)
	struct UImage* BoxBack; // 0x2b8(0x08)
	struct UImage* ChapterTileBack; // 0x2c0(0x08)
	struct UImage* ChapterTileBack_2; // 0x2c8(0x08)
	struct UButton* CreateTeamBtn; // 0x2d0(0x08)
	struct UImage* CreateTeamIcon; // 0x2d8(0x08)
	struct UButton* EditBtn; // 0x2e0(0x08)
	struct UButton* leaveTeamBtn; // 0x2e8(0x08)
	struct UImage* LeaveTeamIcon; // 0x2f0(0x08)
	struct UScrollBox* ListBox; // 0x2f8(0x08)
	struct UScrollBox* ListBox_2; // 0x300(0x08)
	struct UImage* ListBoxBack_2; // 0x308(0x08)
	struct UCanvasPanel* MyTeamList; // 0x310(0x08)
	struct UCanvasPanel* OtherPlayerList; // 0x318(0x08)
	struct UButton* RefreshBtn; // 0x320(0x08)
	struct UButton* RefreshBtn_2; // 0x328(0x08)
	struct UImage* RefreshIcon; // 0x330(0x08)
	struct UImage* RefreshIcon_2; // 0x338(0x08)
	struct UImage* SPACE_2; // 0x340(0x08)
	struct UImage* SPACE_3; // 0x348(0x08)
	struct UImage* SPACE_4; // 0x350(0x08)
	struct UEditableText* TeamName; // 0x358(0x08)
	struct UCanvasPanel* TeamSystem; // 0x360(0x08)
	struct UWBP_MyTeamListEntry_C* WBP_MyTeamListEntry; // 0x368(0x08)
	struct UWBP_OtherPlayerListEntry_C* WBP_OtherPlayerListEntry_306; // 0x370(0x08)
};

