// WidgetBlueprintGeneratedClass W_Options.W_Options_C
// Size: 0x944 (Inherited: 0x260)
struct UW_Options_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UW_TemplateAudio_C* Audio_Effects; // 0x268(0x08)
	struct UW_TemplateAudio_C* Audio_Master; // 0x270(0x08)
	struct UW_TemplateAudio_C* Audio_Music; // 0x278(0x08)
	struct UW_TemplateAudio_C* Audio_Voice; // 0x280(0x08)
	struct UButton* Button_Audio; // 0x288(0x08)
	struct UButton* Button_Cancel; // 0x290(0x08)
	struct UButton* Button_Controls; // 0x298(0x08)
	struct UButton* Button_Default; // 0x2a0(0x08)
	struct UButton* Button_Exit; // 0x2a8(0x08)
	struct UButton* Button_Graphics; // 0x2b0(0x08)
	struct UButton* Button_Interface; // 0x2b8(0x08)
	struct UButton* Button_MainMenu; // 0x2c0(0x08)
	struct UButton* Button_SaveResume; // 0x2c8(0x08)
	struct UW_TemplateGlobalSettings_C* GlobalGraphics; // 0x2d0(0x08)
	struct UW_TemplateGraphic_C* Graphic_AntiAliasing; // 0x2d8(0x08)
	struct UW_TemplateGraphic_C* Graphic_DetailMode; // 0x2e0(0x08)
	struct UW_TemplateGraphic_C* Graphic_Effect; // 0x2e8(0x08)
	struct UW_TemplateGraphic_C* Graphic_Foliage; // 0x2f0(0x08)
	struct UW_TemplateGraphic_C* Graphic_FOV; // 0x2f8(0x08)
	struct UW_TemplateGraphic_C* Graphic_Gamma; // 0x300(0x08)
	struct UW_TemplateGraphic_C* Graphic_MaxFPS; // 0x308(0x08)
	struct UW_TemplateGraphic_C* Graphic_MotionBlur; // 0x310(0x08)
	struct UW_TemplateGraphic_C* Graphic_PostProcess; // 0x318(0x08)
	struct UW_TemplateGraphic_C* Graphic_Resolution; // 0x320(0x08)
	struct UW_TemplateGraphic_C* Graphic_ScreenMode; // 0x328(0x08)
	struct UW_TemplateGraphic_C* Graphic_ScreenScale; // 0x330(0x08)
	struct UW_TemplateGraphic_C* Graphic_Shadow; // 0x338(0x08)
	struct UW_TemplateGraphic_C* Graphic_Texture; // 0x340(0x08)
	struct UW_TemplateGraphic_C* Graphic_ViewDistance; // 0x348(0x08)
	struct UW_TemplateGraphic_C* Graphic_VSync; // 0x350(0x08)
	struct UImage* Image_BackgroundBlack; // 0x358(0x08)
	struct UImage* Image_BackgroundSmoke; // 0x360(0x08)
	struct UImage* Image_Sep_2; // 0x368(0x08)
	struct UImage* Image_Sep_3; // 0x370(0x08)
	struct UW_TemplateInputAction_C* InputAction_Build; // 0x378(0x08)
	struct UW_TemplateInputAction_C* InputAction_Cancel; // 0x380(0x08)
	struct UW_TemplateInputAction_C* InputAction_ChangeInteractionTarget_Down; // 0x388(0x08)
	struct UW_TemplateInputAction_C* InputAction_ChangeInteractionTarget_Up; // 0x390(0x08)
	struct UW_TemplateInputAction_C* InputAction_Crouch; // 0x398(0x08)
	struct UW_TemplateInputAction_C* InputAction_Dodge; // 0x3a0(0x08)
	struct UW_TemplateInputAction_C* InputAction_Fire; // 0x3a8(0x08)
	struct UW_TemplateInputAction_C* InputAction_FocusHigh; // 0x3b0(0x08)
	struct UW_TemplateInputAction_C* InputAction_FocusLow; // 0x3b8(0x08)
	struct UW_TemplateInputAction_C* InputAction_Interaction1; // 0x3c0(0x08)
	struct UW_TemplateInputAction_C* InputAction_Interaction2; // 0x3c8(0x08)
	struct UW_TemplateInputAction_C* InputAction_Interaction3; // 0x3d0(0x08)
	struct UW_TemplateInputAction_C* InputAction_Inventory; // 0x3d8(0x08)
	struct UW_TemplateInputAction_C* InputAction_Journal; // 0x3e0(0x08)
	struct UW_TemplateInputAction_C* InputAction_Jump; // 0x3e8(0x08)
	struct UW_TemplateInputAction_C* InputAction_Light; // 0x3f0(0x08)
	struct UW_TemplateInputAction_C* InputAction_Map; // 0x3f8(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num1; // 0x400(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num2; // 0x408(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num3; // 0x410(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num4; // 0x418(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num5; // 0x420(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num6; // 0x428(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num7; // 0x430(0x08)
	struct UW_TemplateInputAction_C* InputAction_Num8; // 0x438(0x08)
	struct UW_TemplateInputAction_C* InputAction_RotateDown; // 0x440(0x08)
	struct UW_TemplateInputAction_C* InputAction_RotateUp; // 0x448(0x08)
	struct UW_TemplateInputAction_C* InputAction_Snap; // 0x450(0x08)
	struct UW_TemplateInputAction_C* InputAction_Sprint; // 0x458(0x08)
	struct UW_TemplateInputAction_C* InputAction_Submit; // 0x460(0x08)
	struct UW_TemplateInputAction_C* InputAction_Team; // 0x468(0x08)
	struct UW_TemplateInputAction_C* InputAction_Toggle; // 0x470(0x08)
	struct UW_TemplateInputAction_C* InputAction_View; // 0x478(0x08)
	struct UW_TemplateInputAxis_C* InputAxis_Backward; // 0x480(0x08)
	struct UW_TemplateInputAxis_C* InputAxis_Forward; // 0x488(0x08)
	struct UW_TemplateInputAxis_C* InputAxis_Left; // 0x490(0x08)
	struct UW_TemplateInputAxis_C* InputAxis_Right; // 0x498(0x08)
	struct UW_TemplateMouse_C* Mouse_InvertMouse; // 0x4a0(0x08)
	struct UW_TemplateMouse_C* Mouse_Sensitivity; // 0x4a8(0x08)
	struct UBackgroundBlur* MyBackgroundBlur; // 0x4b0(0x08)
	struct UScaleBox* MyScaleBox; // 0x4b8(0x08)
	struct UWidgetSwitcher* MySwitcher; // 0x4c0(0x08)
	struct UScrollBox* ScrollBox_Audio; // 0x4c8(0x08)
	struct UScrollBox* ScrollBox_Controls; // 0x4d0(0x08)
	struct UScrollBox* ScrollBox_Graphics; // 0x4d8(0x08)
	struct UScrollBox* ScrollBox_UI; // 0x4e0(0x08)
	struct UTextBlock* TextBlock_BackSave; // 0x4e8(0x08)
	struct UTextBlock* TextBlock_Cancel; // 0x4f0(0x08)
	struct UTextBlock* TextBlock_Description; // 0x4f8(0x08)
	struct UW_TemplateUI_C* UI_CameraShake; // 0x500(0x08)
	struct UW_TemplateUI_C* UI_CloseUIOnAttacked; // 0x508(0x08)
	struct UW_TemplateUI_C* UI_GameKeyGuide; // 0x510(0x08)
	struct UW_TemplateUI_C* UI_Language; // 0x518(0x08)
	struct UW_TemplateUI_C* UI_Scale; // 0x520(0x08)
	struct UW_TemplateUI_C* UI_Subtitles; // 0x528(0x08)
	struct UW_TemplateUI_C* UI_Tutorial; // 0x530(0x08)
	struct UVerticalBox* VerticalBox_Audio; // 0x538(0x08)
	struct UVerticalBox* VerticalBox_Controls; // 0x540(0x08)
	struct UVerticalBox* VerticalBox_Graphics; // 0x548(0x08)
	struct UVerticalBox* VerticalBox_Nav; // 0x550(0x08)
	struct UVerticalBox* VerticalBox_UI; // 0x558(0x08)
	struct UW_Confirmation_C* W_Confirmation; // 0x560(0x08)
	enum class E_Option ActualOn; // 0x568(0x01)
	char pad_569[0x3]; // 0x569(0x03)
	struct FLinearColor Color_Unhovered; // 0x56c(0x10)
	struct FLinearColor Color_Hovered; // 0x57c(0x10)
	enum class ESlateVisibility BackgroundVisibilty; // 0x58c(0x01)
	char pad_58D[0x3]; // 0x58d(0x03)
	float BackgroundOpacity; // 0x590(0x04)
	char pad_594[0x4]; // 0x594(0x04)
	struct UTexture2D* BackgroundImage; // 0x598(0x08)
	float BackgroundBlackOpacity; // 0x5a0(0x04)
	float BackgroundBlur; // 0x5a4(0x04)
	struct UTexture2D* BackgroundTestImage; // 0x5a8(0x08)
	enum class ESlateVisibility BackgroundSmokeVisibility; // 0x5b0(0x01)
	char pad_5B1[0x3]; // 0x5b1(0x03)
	struct FLinearColor BackgroundSmokeColor; // 0x5b4(0x10)
	float InterfaceScale; // 0x5c4(0x04)
	bool OverrideColor?; // 0x5c8(0x01)
	char pad_5C9[0x3]; // 0x5c9(0x03)
	struct FLinearColor Back_Unhovered; // 0x5cc(0x10)
	struct FLinearColor Back_Hovered; // 0x5dc(0x10)
	struct FLinearColor Back_Selected; // 0x5ec(0x10)
	struct FLinearColor Color_Selected; // 0x5fc(0x10)
	bool ChangeAnimOnSwap?; // 0x60c(0x01)
	char pad_60D[0x3]; // 0x60d(0x03)
	float AnimSpeed; // 0x610(0x04)
	enum class E_Option BeforeOn; // 0x614(0x01)
	char pad_615[0x3]; // 0x615(0x03)
	struct APlayerController* ControllerRef; // 0x618(0x08)
	struct UWidget* ParentWidgetRef; // 0x620(0x08)
	struct FString SaveSlotName; // 0x628(0x10)
	int32_t SaveUserIndex; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct UBP_AntizeSave_C* AntizeSave; // 0x640(0x08)
	struct FText ReturnMessage; // 0x648(0x18)
	struct TArray<struct FS_GraphicIndex> MyGraphicIndex; // 0x660(0x10)
	struct FS_MyControls MyControls; // 0x670(0x30)
	struct FS_MyAudio MyAudio; // 0x6a0(0x10)
	struct FS_MyUI MyUI; // 0x6b0(0x10)
	struct FS_DefaultBackUpOn DefaultOn; // 0x6c0(0x06)
	char pad_6C6[0x2]; // 0x6c6(0x02)
	struct FKey RemoveKey; // 0x6c8(0x18)
	bool HideAllSecondary?; // 0x6e0(0x01)
	bool KeepOpenAfterCancel?; // 0x6e1(0x01)
	bool IsVisible?; // 0x6e2(0x01)
	bool KeepOpenAfterSave?; // 0x6e3(0x01)
	struct FName MainMenuLevel; // 0x6e4(0x08)
	bool PauseGame?; // 0x6ec(0x01)
	struct FS_DefaultBackUpOn BackUpOn; // 0x6ed(0x06)
	char pad_6F3[0x5]; // 0x6f3(0x05)
	struct TArray<struct FS_GraphicLinked> GraphicLinked; // 0x6f8(0x10)
	struct UW_TemplateGlobalSettings_C* Widget_GlobalRef; // 0x708(0x08)
	struct TArray<struct UW_TemplateGraphic_C*> Widgets_Graphic; // 0x710(0x10)
	struct TArray<struct UW_TemplateMouse_C*> Widgets_Mouse; // 0x720(0x10)
	struct TArray<struct UW_TemplateInputAction_C*> Widgets_Action; // 0x730(0x10)
	struct TArray<struct UW_TemplateInputAxis_C*> Widgets_Axis; // 0x740(0x10)
	struct FString CurrentResolution; // 0x750(0x10)
	struct FString CurrentScreenMode; // 0x760(0x10)
	struct TArray<struct UW_TemplateAudio_C*> Widgets_Audio; // 0x770(0x10)
	struct TArray<struct UW_TemplateUI_C*> Widgets_UI; // 0x780(0x10)
	struct FSlateColor Color_MainTitle; // 0x790(0x28)
	struct FSlateColor Color_ColorTitle; // 0x7b8(0x28)
	struct FSlateColor Color_Choice; // 0x7e0(0x28)
	struct FLinearColor Color_LeftRightButton; // 0x808(0x10)
	struct FSlateColor Color_Apply; // 0x818(0x28)
	struct FLinearColor Color_Slider; // 0x840(0x10)
	struct FLinearColor Color_SliderHandle; // 0x850(0x10)
	struct FLinearColor Color_Bar; // 0x860(0x10)
	struct FSlateColor Color_ScrollBarNormal; // 0x870(0x28)
	struct FSlateColor Color_ScrollBarHover; // 0x898(0x28)
	struct FSlateColor Color_ScrollBarDragged; // 0x8c0(0x28)
	struct TArray<struct UWidget*> ScrollGraphicChild; // 0x8e8(0x10)
	struct TArray<struct UWidget*> ScrollControlChild; // 0x8f8(0x10)
	struct TArray<struct UWidget*> ScrollAudioChild; // 0x908(0x10)
	struct TArray<struct UWidget*> ScrollUIChild; // 0x918(0x10)
	struct TArray<struct UWidget*> VerticalNavChild; // 0x928(0x10)
	bool ShowStyle?; // 0x938(0x01)
	bool PauseTimer?; // 0x939(0x01)
	char pad_93A[0x2]; // 0x93a(0x02)
	struct FVector2D LastMousePosition; // 0x93c(0x08)

	void MSG_RequestKey(bool Action?, enum class E_TemplateControlAction ActionName, enum class E_TemplateControlAxis AxisName, struct FInputChord MyKey); // Function W_Options.W_Options_C.MSG_RequestKey // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetInputActionWidget(struct FName ActionName, struct UW_TemplateInputAction_C* Widget); // Function W_Options.W_Options_C.GetInputActionWidget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
	void SetKeyIfNone(); // Function W_Options.W_Options_C.SetKeyIfNone // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetAnimSpeed(float AnimSpeed); // Function W_Options.W_Options_C.GetAnimSpeed // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
	void GetGraphicWidget(); // Function W_Options.W_Options_C.GetGraphicWidget // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void RemoveToolTipsInGame(); // Function W_Options.W_Options_C.RemoveToolTipsInGame // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct FEventReply OnKeyUp(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function W_Options.W_Options_C.OnKeyUp // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function W_Options.W_Options_C.OnKeyDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UWidget* CustomNavigation_Down(enum class EUINavigation Navigation); // Function W_Options.W_Options_C.CustomNavigation_Down // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UWidget* CustomNavigation_Up(enum class EUINavigation Navigation); // Function W_Options.W_Options_C.CustomNavigation_Up // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetCustomFocus(enum class E_Option What, struct UWidget* Object, struct UWidget* Found); // Function W_Options.W_Options_C.GetCustomFocus // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
	void FocusFirstTemplate(struct UWidget* Owner, enum class EUINavigation Navigation, enum class E_Option From); // Function W_Options.W_Options_C.FocusFirstTemplate // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void DefaultConfirmed(); // Function W_Options.W_Options_C.DefaultConfirmed // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void AddGraphicLink(enum class E_TemplateGraphic From, struct FString Commande, enum class E_TemplateGraphic To); // Function W_Options.W_Options_C.AddGraphicLink // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ResetEdit(); // Function W_Options.W_Options_C.ResetEdit // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct FEventReply OnMouseButtonUp(struct FGeometry MyGeometry, struct FPointerEvent MouseEvent); // Function W_Options.W_Options_C.OnMouseButtonUp // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SaveOptions(bool Success?); // Function W_Options.W_Options_C.SaveOptions // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void Hide(); // Function W_Options.W_Options_C.Hide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void CheckForDefault(); // Function W_Options.W_Options_C.CheckForDefault // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void FocusFirstButtonMenu(bool Reset?, enum class EUINavigation Navigation); // Function W_Options.W_Options_C.FocusFirstButtonMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void LoadBackUp(); // Function W_Options.W_Options_C.LoadBackUp // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void MakeBackUp(); // Function W_Options.W_Options_C.MakeBackUp // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void CheckHasFocus(); // Function W_Options.W_Options_C.CheckHasFocus // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetSelectedStyle(); // Function W_Options.W_Options_C.SetSelectedStyle // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void GetTemplateAndApplySettings(); // Function W_Options.W_Options_C.GetTemplateAndApplySettings // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UWidget* CustomNavigation_Right(enum class EUINavigation Navigation); // Function W_Options.W_Options_C.CustomNavigation_Right // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void MSG_ChangeSensitivity(float Sensitivity); // Function W_Options.W_Options_C.MSG_ChangeSensitivity // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void MSG_ChangeInvertMouse(bool InvertMouse); // Function W_Options.W_Options_C.MSG_ChangeInvertMouse // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void MSG_ChangeGameplaySetting(enum class E_TemplateUI Setting, int32_t Index, float Value); // Function W_Options.W_Options_C.MSG_ChangeGameplaySetting // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Quality_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Quality_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Back_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Back_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Controls_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Controls_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Controls_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Controls_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Quality_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Quality_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Restore_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Restore_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Restore_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Restore_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_22_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_22_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Interface_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Interface_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Interface_K2Node_ComponentBoundEvent_26_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Interface_K2Node_ComponentBoundEvent_26_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_27_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_MainMenu_K2Node_ComponentBoundEvent_27_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_28_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_28_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_29_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_29_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_30_OnButtonHoverEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Exit_K2Node_ComponentBoundEvent_30_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void PreConstruct(bool IsDesignTime); // Function W_Options.W_Options_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void AnimChange(); // Function W_Options.W_Options_C.AnimChange // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void EditMouseSetting(bool Sensitivity?, float Sensitivity, bool InvertMouse); // Function W_Options.W_Options_C.EditMouseSetting // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void Construct(); // Function W_Options.W_Options_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void ActiveDefault(enum class E_Option From, enum class E_WorkOn Where); // Function W_Options.W_Options_C.ActiveDefault // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Default_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Default_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void ResetDefault(); // Function W_Options.W_Options_C.ResetDefault // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Back_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void SetEditedGraphic(); // Function W_Options.W_Options_C.SetEditedGraphic // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEditedAction(); // Function W_Options.W_Options_C.SetEditedAction // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEditedAxis(); // Function W_Options.W_Options_C.SetEditedAxis // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEditedMouse(); // Function W_Options.W_Options_C.SetEditedMouse // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BackupSettings(bool KeepOpen?); // Function W_Options.W_Options_C.BackupSettings // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void FocusAfterConfirmation(); // Function W_Options.W_Options_C.FocusAfterConfirmation // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEditedAudio(); // Function W_Options.W_Options_C.SetEditedAudio // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SetEditedUI(); // Function W_Options.W_Options_C.SetEditedUI // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void RefreshFocus(); // Function W_Options.W_Options_C.RefreshFocus // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Controls_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Controls_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Quality_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Quality_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void ContinueSwap(); // Function W_Options.W_Options_C.ContinueSwap // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Sounds_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Interface_K2Node_ComponentBoundEvent_24_OnButtonClickedEvent__DelegateSignature(); // Function W_Options.W_Options_C.BndEvt__Button_Interface_K2Node_ComponentBoundEvent_24_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void ResetCancelStyle(); // Function W_Options.W_Options_C.ResetCancelStyle // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ResetDefaultStyle(); // Function W_Options.W_Options_C.ResetDefaultStyle // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void CheckForStyle(); // Function W_Options.W_Options_C.CheckForStyle // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ApplyResolutionAndScreenMode(struct FString Commande, enum class E_GraphicCommandeType CommandeType, bool Wait?); // Function W_Options.W_Options_C.ApplyResolutionAndScreenMode // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void Initialize Graphic Resolution Widget(); // Function W_Options.W_Options_C.Initialize Graphic Resolution Widget // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_W_Options(int32_t EntryPoint); // Function W_Options.W_Options_C.ExecuteUbergraph_W_Options // (Final|UbergraphFunction|HasDefaults) // @ game+0x1395fe0
};

