// WidgetBlueprintGeneratedClass WBP_Scene_Inventory.WBP_Scene_Inventory_C
// Size: 0x2d8 (Inherited: 0x260)
struct UWBP_Scene_Inventory_C : UUserWidget {
	struct UHorizontalBox* HorizontalBox_2; // 0x260(0x08)
	struct UUniformGridPanel* QuickSlotPanel; // 0x268(0x08)
	struct UVerticalBox* VerticalBox_1; // 0x270(0x08)
	struct UWBP_Equipment_C* WBP_Equipment; // 0x278(0x08)
	struct UWBP_Inventory_DropField_C* WBP_Inventory_DropField; // 0x280(0x08)
	struct UWBP_Invetory_C* WBP_Invetory; // 0x288(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot; // 0x290(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_2; // 0x298(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_3; // 0x2a0(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_4; // 0x2a8(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_5; // 0x2b0(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_6; // 0x2b8(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_7; // 0x2c0(0x08)
	struct UWBP_QuickSlot_C* WBP_QuickSlot_8; // 0x2c8(0x08)
	struct UWBP_WorkBench_C* WBP_WorkBench; // 0x2d0(0x08)
};

