// WidgetBlueprintGeneratedClass WBP_ItemTooltip.WBP_ItemTooltip_C
// Size: 0x2b8 (Inherited: 0x260)
struct UWBP_ItemTooltip_C : UUserWidget {
	struct UBorder* Border_31; // 0x260(0x08)
	struct UTextBlock* TextBlock_3; // 0x268(0x08)
	struct UTextBlock* TextBlock_4; // 0x270(0x08)
	struct UTextBlock* TextBlock_Desc; // 0x278(0x08)
	struct UTextBlock* TextBlock_Name; // 0x280(0x08)
	struct UTextBlock* TextBlock_Stat1; // 0x288(0x08)
	struct UTextBlock* TextBlock_Stat2; // 0x290(0x08)
	struct UTextBlock* TextBlock_Type; // 0x298(0x08)
	struct UVerticalBox* VerticalBox_Status; // 0x2a0(0x08)
	struct UWBP_Line2px_C* WBP_Line2px; // 0x2a8(0x08)
	struct UWBP_Line2px_C* WBP_Line2px_2; // 0x2b0(0x08)

	void GetBorderSize(struct FVector2D Size); // Function WBP_ItemTooltip.WBP_ItemTooltip_C.GetBorderSize // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
};

