// WidgetBlueprintGeneratedClass WBP_Inventory_Store.WBP_Inventory_Store_C
// Size: 0x328 (Inherited: 0x260)
struct UWBP_Inventory_Store_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UImage* Image_117; // 0x268(0x08)
	struct UImage* Image_237; // 0x270(0x08)
	struct UTextBlock* TextBlock_66; // 0x278(0x08)
	struct UUniformGridPanel* UniformGridPanel_157; // 0x280(0x08)
	struct UWBP_BtnPanel_C* WBP_BtnPanel_2; // 0x288(0x08)
	struct UWBP_BtnPanel_C* WBP_BtnPanel_Close; // 0x290(0x08)
	struct UWBP_Line2px_C* WBP_Line2px; // 0x298(0x08)
	struct UWBP_Line2px_C* WBP_Line2px_2; // 0x2a0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall; // 0x2a8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_2; // 0x2b0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_3; // 0x2b8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_4; // 0x2c0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_5; // 0x2c8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_6; // 0x2d0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_7; // 0x2d8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_8; // 0x2e0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_9; // 0x2e8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_10; // 0x2f0(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_11; // 0x2f8(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_12; // 0x300(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory; // 0x308(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_2; // 0x310(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_3; // 0x318(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_4; // 0x320(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Inventory_Store.WBP_Inventory_Store_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_WBP_Inventory_Store(int32_t EntryPoint); // Function WBP_Inventory_Store.WBP_Inventory_Store_C.ExecuteUbergraph_WBP_Inventory_Store // (Final|UbergraphFunction) // @ game+0x1395fe0
};

