// WidgetBlueprintGeneratedClass WBP_Scene_HUD.WBP_Scene_HUD_C
// Size: 0x2a8 (Inherited: 0x260)
struct UWBP_Scene_HUD_C : UUserWidget {
	struct UCanvasPanel* CanvasPanel_1; // 0x260(0x08)
	struct UImage* Image_42; // 0x268(0x08)
	struct UWBP_CrossHairWrapper_C* WBP_CrossHairWrapper; // 0x270(0x08)
	struct UWBP_GameGuideHUD_C* WBP_GameGuideHUD_90; // 0x278(0x08)
	struct UWBP_HudBuff_C* WBP_HudBuff; // 0x280(0x08)
	struct UWBP_HudCompass_C* WBP_HudCompass; // 0x288(0x08)
	struct UWBP_HudHeadMsg_C* WBP_HudHeadMsg; // 0x290(0x08)
	struct UWBP_HudHealth_C* WBP_HudHealth; // 0x298(0x08)
	struct UWBP_HudWaveTimer_C* WBP_HudWaveTimer; // 0x2a0(0x08)
};

