// WidgetBlueprintGeneratedClass WBP_WorkBench.WBP_WorkBench_C
// Size: 0x360 (Inherited: 0x260)
struct UWBP_WorkBench_C : UUserWidget {
	struct UButton* Button_Dec; // 0x260(0x08)
	struct UButton* Button_Dec10; // 0x268(0x08)
	struct UButton* Button_Inc; // 0x270(0x08)
	struct UButton* Button_Inc10; // 0x278(0x08)
	struct UTextBlock* CraftName; // 0x280(0x08)
	struct UHorizontalBox* HorizontalBox_Iteration; // 0x288(0x08)
	struct UImage* Image_117; // 0x290(0x08)
	struct UImage* Image_237; // 0x298(0x08)
	struct UTextBlock* TextBlock_233; // 0x2a0(0x08)
	struct UTextBlock* TextBlock_Iter; // 0x2a8(0x08)
	struct UUniformGridPanel* UniformGridPanel_1; // 0x2b0(0x08)
	struct UUniformGridPanel* UniformGridPanel_157; // 0x2b8(0x08)
	struct UWBP_BtnPanel_C* WBP_BtnPanel; // 0x2c0(0x08)
	struct UWBP_Line2px_C* WBP_Line2px; // 0x2c8(0x08)
	struct UWBP_Line2px_C* WBP_Line2px_2; // 0x2d0(0x08)
	struct UWBP_SlotList_C* WBP_SlotList; // 0x2d8(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_2; // 0x2e0(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_3; // 0x2e8(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_4; // 0x2f0(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_5; // 0x2f8(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_6; // 0x300(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_7; // 0x308(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_8; // 0x310(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_9; // 0x318(0x08)
	struct UWBP_SlotList_C* WBP_SlotList_10; // 0x320(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall; // 0x328(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_2; // 0x330(0x08)
	struct UWBP_SlotSmall_C* WBP_SlotSmall_3; // 0x338(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory; // 0x340(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_2; // 0x348(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_3; // 0x350(0x08)
	struct UWBP_TabCategory_C* WBP_TabCategory_4; // 0x358(0x08)
};

