// WidgetBlueprintGeneratedClass WBP_GameOverAnimation.WBP_GameOverAnimation_C
// Size: 0x2a0 (Inherited: 0x260)
struct UWBP_GameOverAnimation_C : UUserWidget {
	struct UWidgetAnimation* Anm_Fade; // 0x260(0x08)
	struct UWidgetAnimation* Anim_DeadFade; // 0x268(0x08)
	struct UImage* Image_66; // 0x270(0x08)
	struct UImage* Image_305; // 0x278(0x08)
	struct UImage* Image_431; // 0x280(0x08)
	struct UImage* Image_600; // 0x288(0x08)
	struct UImage* Img_Center; // 0x290(0x08)
	struct UImage* Img_Hand; // 0x298(0x08)
};

