// WidgetBlueprintGeneratedClass WBP_Buildwindow.WBP_BuildWindow_C
// Size: 0x2d0 (Inherited: 0x260)
struct UWBP_BuildWindow_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UImage* Image_293; // 0x268(0x08)
	struct UImage* Image_Building; // 0x270(0x08)
	struct UTextBlock* TextBlock_Desc; // 0x278(0x08)
	struct UTextBlock* TextBlock_Name; // 0x280(0x08)
	struct UUniformGridPanel* UniformGridPanel; // 0x288(0x08)
	struct UWBP_BtnPanel_Build_C* WBP_BtnPanel_Build; // 0x290(0x08)
	struct UWBP_ElectricInfo_C* WBP_ElectricInfo; // 0x298(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build; // 0x2a0(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build_2; // 0x2a8(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build_3; // 0x2b0(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build_4; // 0x2b8(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build_5; // 0x2c0(0x08)
	struct UWBP_Wrapper_SlotSmall_Material_Build_C* WBP_Wrapper_SlotSmall_Material_Build_6; // 0x2c8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Buildwindow.WBP_BuildWindow_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_WBP_BuildWindow(int32_t EntryPoint); // Function WBP_Buildwindow.WBP_BuildWindow_C.ExecuteUbergraph_WBP_BuildWindow // (Final|UbergraphFunction) // @ game+0x1395fe0
};

