// WidgetBlueprintGeneratedClass WBP_Wrapper_MainMenu_MainNav.WBP_Wrapper_MainMenu_MainNav_C
// Size: 0x2b0 (Inherited: 0x260)
struct UWBP_Wrapper_MainMenu_MainNav_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWBP_Scene_MainMenu_C* WBP_Scene_MainMenu; // 0x268(0x08)
	struct UWBP_BtnLarge_C* Button_NewGame; // 0x270(0x08)
	struct UWBP_BtnLarge_C* Button_Continue; // 0x278(0x08)
	struct UWBP_BtnLarge_C* Button_Load; // 0x280(0x08)
	struct UWBP_BtnLarge_C* Button_Multiplayer; // 0x288(0x08)
	struct UWBP_BtnLarge_C* Button_Settings; // 0x290(0x08)
	struct UWBP_BtnLarge_C* Button_Credits; // 0x298(0x08)
	struct UWBP_BtnLarge_C* Button_Exit; // 0x2a0(0x08)
	struct UWBP_BtnLarge_C* Button_Singleplayer; // 0x2a8(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Wrapper_MainMenu_MainNav.WBP_Wrapper_MainMenu_MainNav_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void Construct(); // Function WBP_Wrapper_MainMenu_MainNav.WBP_Wrapper_MainMenu_MainNav_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_WBP_Wrapper_MainMenu_MainNav(int32_t EntryPoint); // Function WBP_Wrapper_MainMenu_MainNav.WBP_Wrapper_MainMenu_MainNav_C.ExecuteUbergraph_WBP_Wrapper_MainMenu_MainNav // (Final|UbergraphFunction) // @ game+0x1395fe0
};

