// WidgetBlueprintGeneratedClass Widget_Research.Widget_Research_C
// Size: 0x798 (Inherited: 0x328)
struct UWidget_Research_C : UResearchWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x328(0x08)
	struct UTextBlock* AllResearchDataAmount; // 0x330(0x08)
	struct UButton* Button_Close; // 0x338(0x08)
	struct UCanvasPanel* Canvas_Line; // 0x340(0x08)
	struct UWBP_Wrapper_ResearchCategory_C* Category_Combat; // 0x348(0x08)
	struct UWBP_Wrapper_ResearchCategory_C* Category_Survival; // 0x350(0x08)
	struct UWBP_Wrapper_ResearchCategory_C* Category_Tech; // 0x358(0x08)
	struct UWBP_Wrapper_ResearchCategory_C* Category_Utility; // 0x360(0x08)
	struct UImage* Image; // 0x368(0x08)
	struct UImage* Image_54; // 0x370(0x08)
	struct UImage* Image_128; // 0x378(0x08)
	struct UImage* Image_544; // 0x380(0x08)
	struct UImage* Image_611; // 0x388(0x08)
	struct UImage* Image_TitleIcon; // 0x390(0x08)
	struct UTextBlock* NumOfAllResearches; // 0x398(0x08)
	struct UTextBlock* NumOfCompletedResearches; // 0x3a0(0x08)
	struct UWBP_ResearchLine_Bottom_C* WBP_ResearchLine_Bottom; // 0x3a8(0x08)
	struct UWBP_ResearchLine_Bottom_C* WBP_ResearchLine_Bottom_2; // 0x3b0(0x08)
	struct UWBP_ResearchLine_Center_C* WBP_ResearchLine_Center; // 0x3b8(0x08)
	struct UWBP_ResearchLine_Center_C* WBP_ResearchLine_Center_2; // 0x3c0(0x08)
	struct UWBP_ResearchLine_Top_C* WBP_ResearchLine_Top; // 0x3c8(0x08)
	struct UWBP_ResearchLine_Top_C* WBP_ResearchLine_Top_2; // 0x3d0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElemen_NoviceDiver; // 0x3d8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Acrobat; // 0x3e0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_AnimalHunter; // 0x3e8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Assault; // 0x3f0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Black; // 0x3f8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Bodyguard; // 0x400(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Botanist; // 0x408(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Boxer; // 0x410(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Builder; // 0x418(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Captain; // 0x420(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_CBoxer; // 0x428(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_ChampionJumper; // 0x430(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Chef; // 0x438(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Chem; // 0x440(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Cook; // 0x448(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Corporal; // 0x450(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_DemoMan; // 0x458(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_DEng; // 0x460(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Diver; // 0x468(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_DTec; // 0x470(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Eng; // 0x478(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Farmer; // 0x480(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Fighter; // 0x488(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Food; // 0x490(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_General; // 0x498(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Gourmet; // 0x4a0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Guardsman; // 0x4a8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_HighJumper; // 0x4b0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_HumanHunter; // 0x4b8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Iron; // 0x4c0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JBlack; // 0x4c8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JBuilder; // 0x4d0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JChem; // 0x4d8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JEng; // 0x4e0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Jogger; // 0x4e8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JRes; // 0x4f0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JTec; // 0x4f8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Jumper; // 0x500(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JuniorAcrobat; // 0x508(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_JuniorDiver; // 0x510(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Lieutenant; // 0x518(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_LongJumper; // 0x520(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Marathoner; // 0x528(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Marine; // 0x530(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Marshal; // 0x538(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MartialArtist; // 0x540(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MasterBlade; // 0x548(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MasterBodyguard; // 0x550(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MasterFigher; // 0x558(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MasterWarrior; // 0x560(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MBlack; // 0x568(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MBuilder; // 0x570(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MChem; // 0x578(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Mec; // 0x580(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Medic; // 0x588(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MMec; // 0x590(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MPorter; // 0x598(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_MWorker; // 0x5a0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Natural; // 0x5a8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NBoxer; // 0x5b0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceAcrobat; // 0x5b8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceBodyguard; // 0x5c0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceDemoMan; // 0x5c8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceFighter; // 0x5d0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceGuardsman; // 0x5d8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceRiotPolice; // 0x5e0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NoviceWarrior; // 0x5e8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NPorter; // 0x5f0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_NScavenger; // 0x5f8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_PBoxer; // 0x600(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_PhantomBlade; // 0x608(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Porter; // 0x610(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Private; // 0x618(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_QuickBlade; // 0x620(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Recruit; // 0x628(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Res; // 0x630(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_RiotPolice; // 0x638(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Runner; // 0x640(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SBlack; // 0x648(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SBuilder; // 0x650(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Scavenger; // 0x658(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SChem; // 0x660(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SecretAgent; // 0x668(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SEng; // 0x670(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorAcrobat; // 0x678(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorBodyguard; // 0x680(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorDemoMan; // 0x688(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorDiver; // 0x690(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorFighter; // 0x698(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorGuardsman; // 0x6a0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorRiotPolice; // 0x6a8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SeniorWarrior; // 0x6b0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Sergeant; // 0x6b8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Spartan; // 0x6c0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SpartanSupreme; // 0x6c8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SpecialForce; // 0x6d0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SRes; // 0x6d8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_STec; // 0x6e0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Stone; // 0x6e8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_SWorker; // 0x6f0(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Tactic; // 0x6f8(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Tec; // 0x700(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranDemoMan; // 0x708(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranGuardsman; // 0x710(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranMartialArtist; // 0x718(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranMedic; // 0x720(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranRiotPolice; // 0x728(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranSecretAgent; // 0x730(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VeteranSpartan; // 0x738(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VMec; // 0x740(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VPorter; // 0x748(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_VScavenger; // 0x750(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Warrior; // 0x758(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Wood; // 0x760(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_Worker; // 0x768(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_YoungBlade; // 0x770(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_YoungSpartan; // 0x778(0x08)
	struct UWBP_ResearchElement_C* Widget_ResearchElement_ZombieHunter; // 0x780(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Category; // 0x788(0x08)
	struct UWBP_Wrapper_ResearchCategory_C* SelectedCategoryWidget; // 0x790(0x08)

	struct FText Get All Research Data Amount(); // Function Widget_Research.Widget_Research_C.Get All Research Data Amount // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1395fe0
	struct FVector2D GetLineWidgetOffset(); // Function Widget_Research.Widget_Research_C.GetLineWidgetOffset // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct FVector2D GetLineWidgetSize(); // Function Widget_Research.Widget_Research_C.GetLineWidgetSize // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UCanvasPanel* GetLineCanvas(); // Function Widget_Research.Widget_Research_C.GetLineCanvas // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UResearchLineWidget* GetTopLineWidgetClass(); // Function Widget_Research.Widget_Research_C.GetTopLineWidgetClass // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UResearchLineWidget* GetCenterLineWidgetClass(); // Function Widget_Research.Widget_Research_C.GetCenterLineWidgetClass // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	struct UResearchLineWidget* GetBottomLineWidgetClass(); // Function Widget_Research.Widget_Research_C.GetBottomLineWidgetClass // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void PreConstruct(bool IsDesignTime); // Function Widget_Research.Widget_Research_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void Construct(); // Function Widget_Research.Widget_Research_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_162_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function Widget_Research.Widget_Research_C.BndEvt__Button_162_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function Widget_Research.Widget_Research_C.BndEvt__Button_Close_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void BndEvt__Button_Close_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function Widget_Research.Widget_Research_C.BndEvt__Button_Close_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1395fe0
	void OnSwitchCategory(struct UWBP_Wrapper_ResearchCategory_C* ClickedCategory); // Function Widget_Research.Widget_Research_C.OnSwitchCategory // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SwitchCategoryToUtility(); // Function Widget_Research.Widget_Research_C.SwitchCategoryToUtility // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SwitchCategoryToTech(); // Function Widget_Research.Widget_Research_C.SwitchCategoryToTech // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SwitchCategoryToCombat(); // Function Widget_Research.Widget_Research_C.SwitchCategoryToCombat // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void SwitchCategroyToSurvival(); // Function Widget_Research.Widget_Research_C.SwitchCategroyToSurvival // (BlueprintCallable|BlueprintEvent) // @ game+0x1395fe0
	void ExecuteUbergraph_Widget_Research(int32_t EntryPoint); // Function Widget_Research.Widget_Research_C.ExecuteUbergraph_Widget_Research // (Final|UbergraphFunction) // @ game+0x1395fe0
};

