// WidgetBlueprintGeneratedClass WorldMap.WorldMap_C
// Size: 0x2b0 (Inherited: 0x260)
struct UWorldMap_C : UUserWidget {
	struct UWidgetAnimation* FadeIn; // 0x260(0x08)
	struct UBorder* Border; // 0x268(0x08)
	struct UGamepadCursor_C* GamepadCursor; // 0x270(0x08)
	struct UImage* MapBorder; // 0x278(0x08)
	struct UOverlay* MapOverlay; // 0x280(0x08)
	struct UPlayerMarker_C* PlayerMarker; // 0x288(0x08)
	struct UOverlay* PlayerMarkers; // 0x290(0x08)
	struct UWaypointMarker_C* WaypointMarker; // 0x298(0x08)
	struct UWorldMap_Image_C* WorldMap_Image; // 0x2a0(0x08)
	struct UOverlay* WorldMarkers; // 0x2a8(0x08)
};

